app/views/records/_record_form.html.erb

      <p class="label"><%= f.label "種目名" %></p>
      <%= f.collection_select(:name_id, Exercise.all, :id, :name, {prompt: "種目を選択してください"}, class: 'form-controll') %>
---
SELECT "exercises".* FROM "exercises" ORDER BY "exercises"."created_at" DESC