app/views/records/edit.html.erb

SELECT "exercises".* FROM "exercises" ORDER BY "exercises"."created_at" DESC
---
    <%= f.label "種目名" %><br />
    <%= f.collection_select(:name_id, Exercise.all, :id, :name, {prompt: "種目を選択してください"}, class: 'form-control') %>