app/controllers/exercises_controller.rb

  def index
    @exercises = Exercise.all
---
SELECT "exercises".* FROM "exercises" ORDER BY "exercises"."created_at" DESC

  def create
    @exercise = current_user.exercises.build(exercise_params)
    if @exercise.save
---
INSERT INTO "exercises" ("user_id", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 3], ["name", "sample6"], ["created_at", "2021-09-04 08:41:00.006219"], ["updated_at", "2021-09-04 08:41:00.006219"]]

  def edit
    @exercise = Exercise.find(params[:id])
---
SELECT "exercises".* FROM "exercises" WHERE "exercises"."id" = ? ORDER BY "exercises"."created_at" DESC LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @exercise = Exercise.find(params[:id])
    if @exercise.update(exercise_params)
---
SELECT "exercises".* FROM "exercises" WHERE "exercises"."id" = ? ORDER BY "exercises"."created_at" DESC LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "exercises" SET "name" = ?, "updated_at" = ? WHERE "exercises"."id" = ?  [["name", "dumbel fly2"], ["updated_at", "2021-09-19 11:27:30.210603"], ["id", 1]]

  def destroy
    Exercise.find(params[:id]).destroy
---
DELETE FROM "exercises" WHERE "exercises"."id" = ?  [["id", 3]]
SELECT "exercises".* FROM "exercises" WHERE "exercises"."id" = ? ORDER BY "exercises"."created_at" DESC LIMIT ?  [["id", 3], ["LIMIT", 1]]