app/controllers/records_controller.rb

  def index
    @exercise = Exercise.find(params[:exercise_id])
    @records = Record.where(name_id: params[:exercise_id])
---
SELECT "exercises".* FROM "exercises" WHERE "exercises"."id" = ? ORDER BY "exercises"."created_at" DESC LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "records".* FROM "records" WHERE "records"."name_id" = ? ORDER BY "records"."created_at" DESC  [["name_id", 3]]

  def create
    @exercise = Exercise.find(params[:record][:name_id])
    @record = @exercise.records.build(record_params)
    if @record.save
---
SELECT "exercises".* FROM "exercises" WHERE "exercises"."id" = ? ORDER BY "exercises"."created_at" DESC LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "records" ("exercise_id", "name_id", "weight", "reps_count", "note", "RM", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def edit
    @record = Record.find(params[:id])
---
SELECT "records".* FROM "records" WHERE "records"."id" = ? ORDER BY "records"."created_at" DESC LIMIT ?  [["id", 44], ["LIMIT", 1]]

  def update
    @record = Record.find(params[:id])
    if @record.update(record_params)
---
SELECT "records".* FROM "records" WHERE "records"."id" = ? ORDER BY "records"."created_at" DESC LIMIT ?  [["id", 44], ["LIMIT", 1]]
UPDATE "records" SET "date" = ?, "updated_at" = ? WHERE "records"."id" = ?  [["date", "2021-09-19"], ["updated_at", "2021-09-19 11:24:56.384941"], ["id", 44]]

  def destroy
    if Record.find(params[:id]).destroy
---
DELETE FROM "records" WHERE "records"."id" = ?  [["id", 45]]
SELECT "records".* FROM "records" WHERE "records"."id" = ? ORDER BY "records"."created_at" DESC LIMIT ?  [["id", 45], ["LIMIT", 1]]