app/views/exercises/index.html.erb

SELECT "records"."date", "records"."RM" FROM "records" WHERE "records"."name_id" = ? ORDER BY "records"."created_at" DESC  [["name_id", 4]]
---
  <%# graph = exercise_type.pluck(:date, :RM) %>
  <% graph = Record.where(name_id: exercise.id).pluck(:date, :RM) %>